<template>
  <div>
    <ve-line :data="chartData"></ve-line>
    <ve-map :data="chartData2"></ve-map>
    <ve-scatter :data="chartData3" :settings="chartSettings"></ve-scatter>
  </div>
</template>

<script>
  export default {
    data: function () {
      this.chartSettings = {
        tooltipTrigger: 'axis',
        xAxisType:'category',
        yAxisType:'category'
      }
      return {
        chartData: {
          columns: ['日期', '访问用户', '下单用户', '下单率'],
          rows: [
            { '日期': '1/1', '访问用户': 1393, '下单用户': 1093, '下单率': 0.32 },
            { '日期': '1/2', '访问用户': 3530, '下单用户': 3230, '下单率': 0.26 },
            { '日期': '1/3', '访问用户': 2923, '下单用户': 2623, '下单率': 0.76 },
            { '日期': '1/4', '访问用户': 1723, '下单用户': 1423, '下单率': 0.49 },
            { '日期': '1/5', '访问用户': 3792, '下单用户': 3492, '下单率': 0.323 },
            { '日期': '1/6', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 }
          ]
        },
        chartData2: {
          columns: ['位置', '税收', '人口', '面积'],
          rows: [
            { '位置': '吉林', '税收': 123, '人口': 123, '面积': 92134 },
            { '位置': '北京', '税收': 1223, '人口': 2123, '面积': 29234 },
            { '位置': '上海', '税收': 2123, '人口': 1243, '面积': 94234 },
            { '位置': '浙江', '税收': 4123, '人口': 5123, '面积': 29234 }
          ]
        },
        chartData3: {
          columns: ['日期', '访问用户', '下单用户', '年龄'],
          rows: [
            { '日期': '1/1', '访问用户': "asdf", '年龄': 3, '下单用户': "abc" },
            { '日期': '1/2', '访问用户': "Asdf", '年龄': 6, '下单用户': "asd" },
            { '日期': '1/3', '访问用户': "sdf", '年龄': 9, '下单用户': "sadfd" },
            { '日期': '1/4', '访问用户': "asdf", '年龄': 12, '下单用户': "sadf" },
            { '日期': '1/5', '访问用户': "asdfasf", '年龄': 15, '下单用户': "sadfd" },
            { '日期': '1/6', '访问用户': "sadf", '年龄': 20, '下单用户': "asdfd" }
          ]
        },
      }
    }
  }
</script>
